[
    {
        "category": "Research", "list": [
        {
            "name": "Acoustic LLM", 
            "url": "", 
            "content": "Large Language Models (LLMs) have shown remarkable capabilities in text and multimodal processing, yet they fundamentally lack physical awareness--understanding of real-world physical phenomena. We explore the feasibility of teaching LLMs physical awareness through sound, focusing on fundamental physical phenomena like the Doppler effect, multipath effect, and spatial relationships. To overcome data scarcity, we introduce a physics-based simulator combining real-world sound sources with controlled physical channels to generate diverse training data. Using this simulator, we build AQA-PHY, a comprehensive Audio Question-Answer dataset, and propose an audio encoder that processes both magnitude and phase information. By connecting our audio encoder to state-of-the-art LLMs, we demonstrate reasonable results in both simulated and real-world tasks, such as line-of-sight detection, Doppler effect estimation, and Direction-of-Arrival estimation, paving the way for enabling LLMs to understand physical phenomena.", 
            "figure": "./files/Fig/illus_icml_2025_0.png",
            "figurewidth": "500",
            "title": "Teaching Physical Awareness to LLMs through Sounds"
        },
        {
            "name": "MetaSpeaker", 
            "url": "https://dl.acm.org/doi/10.1145/3570361.3613279", 
            "content": "An advanced speaker that can project audible sources precisely in space, even down to a single point. By using air’s nonlinearity, Meta-Speaker reproduces sound through intersecting ultrasonic beams from two arrays, creating a perceivable source in 3D space.", 
            "figure": "./files/Fig/MetaSpeaker.png",
            "figurewidth": "800",
            "title": "Acoustic Source Projection by Exploiting Air Nonlinearity"
        },
        {
            "name": "MicNest", 
            "url": "https://micnest.github.io/", 
            "content": "An acoustic localization system for precise drone landing. MicNest is able to localize a drone <b>120 m</b> away with <b>0.53%</b> relative localization error at <b>20 Hz</b> location update frequency.", 
            "figure": "./files/Fig/MicNest.png",
            "figurewidth": "500",
            "title": "Acoustic Localization System for Precise Drone Landing"
        },
        {
            "name": "MotorBeat", 
            "url": "https://dl.acm.org/doi/10.1145/3517255", 
            "content": "An acoustic communication approach that connects small appliances to the Internet. Our key idea is to exploit direct current (DC) motors, which are common components of small appliances, to transmit acoustic messages to a smart speaker. The communciaiton range is up to <b>10 m</b>.", 
            "figure": "./files/Fig/MotorBeat.png",
            "figurewidth": "600",
            "title": "Acoustic Communication System for Small Appliances"
        }
        ]
    }
]
